In [ ]:
# import library
from bs4 import BeautifulSoup
import requests
import pandas as pd

In [ ]:
# setting up
MY_URL = "https://www.worldometers.info/coronavirus"
page = requests.get(MY_URL)
soup = BeautifulSoup(page.text, 'html5lib')

In [ ]:
soup.find_all('h1')

In [ ]:
# find table header in soup
table_header = soup.select('#main_table_countries_today thead tr')

In [ ]:
table_header

[<tr>
 <th width="1%">#</th>
 <th width="100">Country,<br/>Other</th>
 <th width="20">Total<br/>Cases</th>
 <th width="30">New<br/>Cases</th>
 <th width="30">Total<br/>Deaths</th>
 <th width="30">New<br/>Deaths</th>
 <th width="30">Total<br/>Recovered</th>
 <th width="30">New<br/>Recovered</th>
 <th width="30">Active<br/>Cases</th>
 <th width="30">Serious,<br/>Critical</th>
 <th width="30">Tot Cases/<br/>1M pop</th>
 <th width="30">Deaths/<br/>1M pop</th>
 <th width="30">Total<br/>Tests</th>
 <th width="30">Tests/<br/>
 <nobr>1M pop</nobr>
 </th>
 <th width="30">Population</th>
 <th style="display:none" width="30">Continent</th>
 <th width="30">1 Case<br/>every X ppl</th><th width="30">1 Death<br/>every X ppl</th><th width="30">1 Test<br/>every X ppl</th>
 </tr>]

In [ ]:
header = [th.text.strip() for th in table_header[0]('th')]

In [ ]:
header

['#',
 'Country,Other',
 'TotalCases',
 'NewCases',
 'TotalDeaths',
 'NewDeaths',
 'TotalRecovered',
 'NewRecovered',
 'ActiveCases',
 'Serious,Critical',
 'Tot\xa0Cases/1M pop',
 'Deaths/1M pop',
 'TotalTests',
 'Tests/\n1M pop',
 'Population',
 'Continent',
 '1 Caseevery X ppl',
 '1 Deathevery X ppl',
 '1 Testevery X ppl']

In [ ]:
# find table header in soup
table_rows = soup.select('#main_table_countries_today tbody tr')

In [ ]:
rows_list = []
for tr in table_rows:
    row = [td.text.strip() for td in tr('td')]
    rows_list.append(row)

print(rows_list[:3])

[['', 'North America', '36,658,497', '+5,045', '834,217', '+874', '28,364,194', '+2,880', '7,460,086', '16,081', '', '', '', '', '', 'North America', '', '', ''], ['', 'South America', '22,270,149', '+1,442', '587,870', '+16', '19,899,341', '+985', '1,782,938', '21,864', '', '', '', '', '', 'South America', '', '', ''], ['', 'Asia', '30,630,437', '+690', '444,269', '+1', '27,414,749', '+525', '2,771,419', '27,490', '', '', '', '', '', 'Asia', '', '', '']]

In [ ]:
# create a new dataframe
df = pd.DataFrame(rows_list, columns = header)
df.head()

  #  Country,Other  ... 1 Deathevery X ppl 1 Testevery X ppl
0    North America  ...
1    South America  ...
2             Asia  ...
3           Europe  ...
4           Africa  ...

[5 rows x 19 columns]

In [ ]:
df[df["Country,Other"] == "Thailand"]

       # Country,Other  ... 1 Deathevery X ppl 1 Testevery X ppl
119  112      Thailand  ...            728,493                 9

[1 rows x 19 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 237 entries, 0 to 236
Data columns (total 19 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   #                   237 non-null    object
 1   Country,Other       237 non-null    object
 2   TotalCases          237 non-null    object
 3   NewCases            237 non-null    object
 4   TotalDeaths         237 non-null    object
 5   NewDeaths           237 non-null    object
 6   TotalRecovered      237 non-null    object
 7   NewRecovered        237 non-null    object
 8   ActiveCases         237 non-null    object
 9   Serious,Critical    237 non-null    object
 10  Tot Cases/1M pop    237 non-null    object
 11  Deaths/1M pop       237 non-null    object
 12  TotalTests          237 non-null    object
 13  Tests/
1M pop       237 non-null    object
 14  Population          237 non-null    object
 15  Continent           237 non-null    object
 16  1 Caseevery X ppl   237 non-null    object
 17  1 Deathevery X ppl  237 non-null    object
 18  1 Testevery X ppl   237 non-null    object
dtypes: object(19)
memory usage: 35.3+ KB

In [ ]:
df.query('TotalCases == "30,869"')

       # Country,Other  ... 1 Deathevery X ppl 1 Testevery X ppl
119  112      Thailand  ...            728,493                 9

[1 rows x 19 columns]

In [ ]:
df.columns = [
    'no',
    'country',
    'totalcases',
    'newcases',
    'totaldeaths',
    'newdeaths',
    'totalrecovered',
    'newrecovered',
    'activecases',
    'serious_critical',
    'total_case_1m_pop',
    'total_deaths_1m_pop',
    'total_tests',
    'test_1m_pop',
    'population',
    'continent',
    'case_every',
    'death_every',
    'test_every'
]

In [ ]:
df.query("country == 'Thailand'")

      no   country totalcases  ... case_every death_every test_every
119  112  Thailand     30,869  ...      2,266     728,493          9

[1 rows x 19 columns]

In [ ]:
df['totalcases'] = df['totalcases'].str.replace(',', '').astype('int')
df.head()

  no        country  totalcases  ... case_every death_every test_every
0     North America    36658497  ...
1     South America    22270149  ...
2              Asia    30630437  ...
3            Europe    41311921  ...
4            Africa     4366232  ...

[5 rows x 19 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 237 entries, 0 to 236
Data columns (total 19 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   no                   237 non-null    object
 1   country              237 non-null    object
 2   totalcases           237 non-null    int64
 3   newcases             237 non-null    object
 4   totaldeaths          237 non-null    object
 5   newdeaths            237 non-null    object
 6   totalrecovered       237 non-null    object
 7   newrecovered         237 non-null    object
 8   activecases          237 non-null    object
 9   serious_critical     237 non-null    object
 10  total_case_1m_pop    237 non-null    object
 11  total_deaths_1m_pop  237 non-null    object
 12  total_tests          237 non-null    object
 13  test_1m_pop          237 non-null    object
 14  population           237 non-null    object
 15  continent            237 non-null    object
 16  case_every           237 non-null    object
 17  death_every          237 non-null    object
 18  test_every           237 non-null    object
dtypes: int64(1), object(18)
memory usage: 35.3+ KB

# **Line Notify**

In [ ]:
# get first values
Country = df.query("country == 'Thailand'")['country'].values[0]
Totalcases = df.query("country == 'Thailand'")['totalcases'].values[0]

In [ ]:
line_token = "111gScuWIyAUhS6lyYKuvCYRm83FzipEnbrh5GEKAO3"

In [ ]:
def line_notify(message, token):
    url = "https://notify-api.line.me/api/notify"
    data = ({'message': message})
    LINE_HEADERS = {"Authorization": "Bearer " + token}
    session = requests.Session()
    response = session.post(url, headers=LINE_HEADERS, data = data)
    return response

In [ ]:
response = line_notify('\nผู้ติดเชื้อ Covid ประเทศ: ' + Country + '\nจำนวน: ' + str(Totalcases), line_token)

In [ ]:
df.head()

  no        country  totalcases  ... case_every death_every test_every
0     North America    36658497  ...
1     South America    22270149  ...
2              Asia    30630437  ...
3            Europe    41311921  ...
4            Africa     4366232  ...

[5 rows x 19 columns]